Revit 2026 API

# GenericImportOptions Properties

---

The GenericImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RefPoint | Reference point (in Revit) to which the image is going to be inserted. |

#### Reference

GenericImportOptions Class

Autodesk.Revit.DB Namespace